/*
 * @Author: wuhao
 * @Date: 2018-04-25 16:52:09
 * @Last Modified by: wuhao
 * @Last Modified time: 2018-04-25 16:54:00
 *
 * 导出字段值  注：由于和商家平台的不一样，故提取出来
 */

/**
   * 获取 订单基本信息 导出字段
   */
export const orderBaseInfo = [
  '订单号',
  '所属商家',
  '订单生成时间',
  '收货人姓名',
  '收货人电话',
  '收货人地址',
  '配送地区',
  '用户ID',
  '订单总金额',
  '订单优惠金额',
  '支付方式',
  '订单状态',
  '支付状态',
  '所属项目',
  '关联母单号',
  '是否异常',
  '订单类型',
  '订单支付信息',
];

  /**
   * 获取 订单商品信息 导出字段
   */
export const orderProductInfo = [
  '订单号',
  '所属商家',
  '订单生成时间',
  '所属项目',
  '商品名称',
  '商品分类',
  '数量',
  '用户ID',
  '商品总价',
  '订单状态',
  '支付状态',
  '收货人姓名',
  '收货人手机',
  '收货人地址',
  '配送地区',
  '商品单价',
  '商品规格',
  '商品ID',
  '订单类型',
];

  /**
   * 获取 订单信息 导出字段
   */
export const orderInfo = [
  '订单号',
  '所属商家',
  '订单来源',
  '订单生成时间',
  '收货人电话',
  '收货人地址',
  '收货人姓名',
  '配送地区',
  '用户ID',
  '订单总金额',
  '物流商',
  '物流单号',
  '订单运费',
  '流水号',
  '支付方式',
  '订单优惠金额',
  '订单状态',
  '支付状态',
  '订单完成时间',
  '所属项目',
  '发票信息',
  '商品ID',
  '商品名称',
  '商品空间',
  '数量',
  '商品单价',
  '商品总价',
  '商品规格',
  '是否赠品',
  '商品功能',
  '商品风格',
  '商品材质',
  '所属厂商',
  '订单类型',
  '是否超额',
  '结算状态',
  '结算金额',
];
